[Message]
1=You need input %d bit of serial number.
2=The software copyright can run %d date,you need contact Han'slaser customer service for help, apply mend which matched authorization again(softDog ID=%s, verify code=%s)
3=The equipment had run a year, you need contact Han'slaser customer service for maintain to insure it run safely and normally
4=The module data download failing or the ver incorrect, please check-up the software setup whether in right
5=Check-up the softDog connect  and the driver setup whether in right when it appeared unconventionality
6=The software copryright matured at present,you need contact Han'slaser customer service for use, apply mend which matched authorization again(softDog ID=%s, verify code=%s)
7=When the type of sofeware unmatching,you need affirm the softDog suited with the software, or cotact  Han'slaser customer service for help(softDog ID=%s, type verify code=%s)
8=When the type of sofeware unmatching,you need affirm the softDog suited with the software. Check the software, Dcp1000 card & softDog update wether in need(softDog ID=%s, type verify code=%s)
9=You need contact Han'slaser customer service for help if the software, Dcp1000 card& softDog unmatching.
10=Softdog appeared unknown error
11=Softdog not found!
12=Found the softDog but illegality.
13=The module data download failing or the ver incorrect, you need check the software setup whether in right
14=Inserted softDog more than 1 pcs
15=The parameter of function nonsupport
16=The control card unknown
17=The softDog type unknown
18=The data download in Dcp1000 card failing
19=Take the function data of control card connector failing
20=The control card not exist.
21=Download the data to card failed.
22=The control card tie up the softdog.
23=Licence key checkout successfully, the control card tie up the softdog successfully.
24=Licence key checkout failed, system error.
25=When the type of sofeware unmatching,you need affirm the softDog suited with the equipment, or cotact  Han'slaser customer service for help(softDog ID=%s, type verify code=%s)
26=Found unbinded card. Please finish binding first.
27=Control card not found or no binded,please use ActiveDog check first.
28=Found some cards, but no card open the multicard-running flas. Pull out the cards not needed, then reset software.
29=Current softdog had binded with other card, Are you sure repeatly bind this softdog to cards?

[Caption]
DlgBindCaption=Active-Bind
DlgBindDogID=softDog ID
DlgBindCardID=Card ID
DlgBindBtnBind=Bind
DlgBindQuit=Quit

DlgEnterCodeCaption=Active Code
DlgEnterCodeTime=Release Time
DlgEnterCodeDogID=softDog ID
DlgEnterCodeCheckCode=Active Code
DlgEnterCodeCheckTimes=Active Times
DlgEnterCodeEnterCodeTitle=Please input %d bit of serie number
DlgEnterCodeBtnOK=OK
DlgEnterCodeBtnCancel=Cancel